{"_id":{"$oid":"5a757b53e8150d0a7e2d68ee"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Best Budget TV!","upvotes":"3732","downvotes":"535","content":"I have purchased the TV on FK as it was on deal, otherwise I would have bought it here itself.\n  \u003cbr/\u003e\n  1.Great Display at this price. Pictures look clear and crisp and color balance is good.\n  \u003cbr/\u003e\n  2. I have seen TCL, SANYO, Micromax, Philips, Videocon and VU has amazing built with amazingly thin back panel and good quality of Plastic. Remote quality is also decent.\n  \u003cbr/\u003e\n  3. The sound is not great on this TV, as the price paid is not much I would just ignore the sound at the moment.\n  \u003cbr/\u003e\n  4. As Menu could have been better and while playing movies from USB, if you stop it starts again from start, also to reach a point you need to either forward or remember the lapse time where you left.\n  \u003cbr/\u003e\n  5. Most of the ports are in Side which need regular connectivity. 2 USB, 2 HDMI which are well spaces, so that I plug in my Chrome cast and Fire TV at a time.\n  \u003cbr/\u003e\n  6. 60 Hz, which is good for this price. Higher refresh rate means more smooth rendering and it fails at few places when I played a Blue ray/4K video with slow camera panning colors overlap, not a big failure at all. No impact on Fast moving scenes and Gaming.\n  \u003cbr/\u003e\n  7. Works well with PS3 for smooth game play, CHROMECAST connected without any issues and great picture on full HD rendering\n  \u003cbr/\u003e\n  8. The installation took 3 days of time and I am quite disappointed with multiple follow ups\n  \u003cbr/\u003e\n  9. 1 Years warranty is good and competitive\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  10.Great VALUE for MONEY. VU is a good brand and is offering good product at best price.\n  \u003cbr/\u003e\n  Final Verdict   Go for it, if you are looking for a good picture quality with great sounds and have a Budget constraint\n  \u003cbr/\u003e\n  I hope my review was helpful!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68ef"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Great TV......Flipkart Rocks....Go for it.","upvotes":"1054","downvotes":"202","content":"I purchased this tv in BBD Sale.......i got it at very attractive price...before taking this review bit deeep....overview is:\n  \u003cbr/\u003e\n  1. Flipkart Service 10/10 amazing\n  \u003cbr/\u003e\n  2. TV quality 09/10\n  \u003cbr/\u003e\n  3. Installation 09/10\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  1.FLIPKART SERVICE: I ordered it on 20.08.2017 \u0026amp; it was delivered on 22.08.2017 with great packing.\n  \u003cbr/\u003e\n  2.TV QUALITY: Before Purchasing this i was confused Between VU \u0026amp; LG \u0026amp; the price difference was about 50% but concidering reviews i decided to purchase VUTV.\n  \u003cbr/\u003e\n  i used this tv for 10 days \u0026amp; trust me its a must buy TV.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  PROS:\n  \u003cbr/\u003e\n  Great Picture Quality\n  \u003cbr/\u003e\n  Can extend warrenty upto 3 years with nominal charges\n  \u003cbr/\u003e\n  Sound is loud enough but if you want theatre kind experience use music system with this\n  \u003cbr/\u003e\n  (i am using F\u0026amp;D 550x with this \u0026amp; experience is awesome)\n  \u003cbr/\u003e\n  almost every format video can be played through USB/Pendrive\n  \u003cbr/\u003e\n  WIDE CONNECTIVITY: 2 X USB, 2 X HDMI, VGA, AUDIO IN, AUDIO OUT ETC\n  \u003cbr/\u003e\n  Can use Chrome cast \u0026amp; fire tv stick to experience smart tv\n  \u003cbr/\u003e\n  Value for money Product.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  CONS:\n  \u003cbr/\u003e\n  Built Quality is not up to the mark.\n  \u003cbr/\u003e\n  User Interface \u0026amp; Media Player could have been better.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Final Verdict   Dont Worry.....Go for it.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f0"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Four Stars","upvotes":"650","downvotes":"279","content":"Got the product at right time .thanks to Flipkart and when it comes to installation though it was late by 2 r 3 days Flipkart responded in a good way... quality wise our satisfaction will exceed our expectations ...with in our budget.......\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f1"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Weakened by a few critical misses.","upvotes":"12","downvotes":"1","content":"It's hooked up as a HDMI-connected monitor, the viewing distance is ~10 feet. For me the budget was critical, and the distance meant the largest available (cheap) 32\" PC monitor would still be too small. First the good stuff:\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  1. The build quality is above average at this price level. The casing doesn't creak and the gaps are uniform and small.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  2. The sound quality is usable for basic YouTube and Prime Video. Will not shake the earth, but the vocal quality is intelligible and there is a coaxial output to hook up a receiver or DAC. This reduces the amount of cabling, and provides the option of not using the internal speakers at all. The coaxial is a nice unexpected bonus,\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  3. Picture quality is above average for internet video, and so it will be for satellite TV as well. The colour is about average but the panel itself is probably very narrow gamut. For broadcast this will probably not be an issue.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  4. The price itself is very low. It is well below the price of any other 'branded' TV and the brand itself has been around for a bit,.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  5. Flipkart delivery and service was outstanding, a marked improvement from what it was six months ago. Very impressed with the quick turnaround - I doubt a local store purchase would have been as efficient.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Now the bad stuff:\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  1. The front panel indicator light is way too bright. It actually hurt after ten minutes so I had to tape it over with some foam so I could actually look at the screen.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  2. With the screen blanked, there is enough backlight bleed to light a reasonably sized room. The power LED is not really needed once the TV is on - and the black levels are correspondingly poor. This is an issue with almost every IPS display including professional ones, but it's usually not this bad. There are lots of bright areas at the periphery, indicating poor polariser performance.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  3. The colour while good enough for broadcast, falls short of a proper 8 bpp target. The internal engine is either not using FRC, or the panel is even lower grade than I initially thought. The gamut is also very narrow, the Red is very far off target and the Green is poor - though better than red. Blue is the only colour that is on target, but part of that may be due to the bluish backlight, which is a feature of almost all cheap TVs. The quality of the LEDs in the backlight is very poor, leading to a gamut tilted towards blue. After calibration the colours came closer to the target but you can't fix inherent panel issues this way.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  4. The processing engine in the TV is hyperactive, always trying to sharpen or enhance the image, but it trips over its own tail at times. There is some amount of resampling that makes games respond very poorly, with slow frame transitions in low contrast areas. The panel is touted as 60Hz, which is probably the drive frequency for the backlight. The engine is not capable of over 30Hz internally and the result is a light stutter/blur when moving between areas. I suspect this will be a problem in very fast or dark scenes as well.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  5. The weakest part of the TV is the firmware. The software fails to save the user-selected zoom setting, which means you have to manually scale from your display, or live with a bit of overscan at the default 16:9 setting. Broadcast and console users will probably not even notice, but those who have it hooked up to a HTPC will either have to rescale the display resulting in loss of 1:1 pixel mapping, or set the zoom every single power-up. The firmware also offers no options for custom white balance, which would have gone a long way in fixing the TVs off-colour gamut to some extent. Whereas the processing engine and panel cost money - and thus can still be forgiven in a TV at this price, there is no excuse for poor firmware.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f2"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Value-for-money","upvotes":"662","downvotes":"290","content":"I have booked TV on 25 Sep 17 for Kanpur U.P. in 18400rs.. delivered on 01 oct 17 at 12 pm packing was extremely good..  and installed on 02 oct 17 at 11 am. I'm satisfied with delivery and installation.. 5/5\n  \u003cbr/\u003e\n  Now comes on TV..\n  \u003cbr/\u003e\n  Build quality- 4/5 totally plastic.. which is not give u gazab look..\n  \u003cbr/\u003e\n  Picture quality- 4/5 best in this price.. but not superb.. u ll feel ur self wn u ll see Sony and LG picture quality.\n  \u003cbr/\u003e\n  Sound quality- 3/5 VU have too improve here.. Bcoz sound is loud enough for 15x15 room.. but not clear.. ( which my mammy complaining )\n  \u003cbr/\u003e\n  Connectivity- 4/5 DTH is working fine.. While connecting with 3.5 MM headphone jack to home theater 5.1 .. humming sound is coming.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Pros..\n  \u003cbr/\u003e\n  Everything in this price range is just Wow.. I belong to a small town Kanpur.. where ppl don't go for new brands easily..\n  \u003cbr/\u003e\n  Google Cromecast 2 is working superbly ( screen mirroring too )\n  \u003cbr/\u003e\n  Bezzels are very thin.. which give to Sony 43W772E look.\n  \u003cbr/\u003e\n  Extended warranty is a good deal ( if u have kids in home or used TV more than 4hrs in a day ) I have taken 2 years extended warranty in 1452rs.\n  \u003cbr/\u003e\n  Cons..\n  \u003cbr/\u003e\n  Sound is not good.. Quality of remote is very cheap.. and TV is lil bit thick..\n  \u003cbr/\u003e\n  Go for it guys.. in this price range.. u ll not get this type of best deal. Thank you Flipkart.\n  \u003cbr/\u003e\n  If u find this review helpful..than give a thumbs up.. Thank you.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f3"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific","upvotes":"844","downvotes":"380","content":"Definitely a big Deal    ! @21999 (VU 39 FHD)\n  \u003cbr/\u003e\n  Guys this TV I got  on June 18. Until  now its completely  fine. And the quality of  the TV is on par with the other branded products like Samsung/Sony with respect  to the picture quality especially  the HD channels are too good.And even the frame of the TV is so thin that it  looks like a premium TV.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Even the extended  warranty you can get from Jeeves for additional  2 years for Rs 2150. So you get a total of 3 years warranty. Just go for it\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Will add more details after some time...!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f4"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worthless","upvotes":"135","downvotes":"50","content":"I bought this Vu led tv (model no. H40D321) from flipkart on 21.09.2017 and installed on 23.09.17. On 10.1017 , suddenly there was a sound of small burst in the tv and the display went off. Thereafter, i switched off the tv and switched it on again a visible mark on the screen appeared. I lodged a complaint regarding the incident with Vu customer care vide no.133926. On 12\n  \u003cbr/\u003e\n  10.17, the engineer visited my residence and i narrated the whole thing to him but he said that u have damaged the display to which i replied that there is not even a single scratch on the screen from outside, if anything was hit on it there would have been some kind of impact mark on the screen. He further said that the display cannot be replaced. I am very disappointed with the customer service. I bought this led tv on 21 september 2017 with high hopes from Vu but customer service is awful. I feel cheated and would never recommend vu led tvs to anyone. I had also used lg samsung led tvs who had better customer service. I would not suggest the customers to buy vu led tvs. So freinds, dont go for cheap rates rather go for brands like lg samsung sony. Utterly disappointed. I bought the led tv on 21 sept 2017 for Rs 18499 but all my money has is wasted as vu customer care has informed me that fault is yours.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Nikhil Dogra\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f5"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Waste of money!","upvotes":"24","downvotes":"5","content":"unexpected return request closed. this seems they cheated to customer . I have purchase many product from flipkart but when problem come flipkart cheated me.\n  \u003cbr/\u003e\n  I will complain this to consumer court ASAP\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f6"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Unsatisfactory","upvotes":"44","downvotes":"13","content":"Product is very good considering price, but flipkart service is disappointing.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b53e8150d0a7e2d68f7"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrible product","upvotes":"14","downvotes":"2","content":"No installation done still.i purchased before 15 days\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68f8"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Waste of money!","upvotes":"26","downvotes":"7","content":"Tv is very good and deserves at least 4 stars but Flipkart service has been worst ever in this big billion sale!!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68f9"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Fabulous!","upvotes":"58","downvotes":"21","content":"Good TV at awesome price!!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68fa"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Absolute rubbish!","upvotes":"5","downvotes":"0","content":"product is best but flipkart service very worst\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68fb"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Best in given price range","upvotes":"14","downvotes":"3","content":"One of the best TV available in the market with high end features. Initially was skeptical about the promised features. Running from past couple of months. Best effect with HD channels.\n  \u003cbr/\u003e\n  Thank you Flipkart.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68fc"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worst experience ever!","upvotes":"33","downvotes":"12","content":"Red dots are appearing. Do buy it\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68fd"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Three Stars","upvotes":"80","downvotes":"40","content":"Product delivered timely, safely and installed also on time.picture quality good, sound quality average,digital audio port not working . Issue raised to Flip kart and VU team. Waiting their response.Rest is well.\n  \u003cbr/\u003e\n  Thanks Flip kart .\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68fe"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Perfect product!","upvotes":"5","downvotes":"0","content":"Good picture quality and sounds\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d68ff"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"5","downvotes":"0","content":"After long days searching, Finally I bought vu.... Good clarity and sound ...\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d6900"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Expected a better product","upvotes":"37","downvotes":"16","content":"The product is awesome. But, the service by flipkart is pathetic. No proper communication form the support team. The guy who came for installation seemed less knowledgeable about the product had limited reply to whatever I asked. If you are planning to by a separate wall mount, even the one suggested by flipkart, they are not allowed to install was mentioned by the Jeeves installation guy. I purchased this TV with additional warranty of 3 years, the support team, the delivery guys and the Jeeves guy had no proper answer as to how will I get the confirmation of the extended warranty. I still have no answer. Please call.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b58e8150d0a7e2d6901"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Does the job","upvotes":"10","downvotes":"2","content":"Video quality is ok\n  \u003cbr/\u003e\n  Price is worth\n  \u003cbr/\u003e\n  But audio quality is not as good as\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6902"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Five Stars","upvotes":"28","downvotes":"12","content":"The delivery of ekart and installation by Jeeves was excellent which was done on the same day of delivery. I was impressed by the quality of picture and sound in the tv. It's a perfect VFM product. Till now didn't find any cons for this product. Perfect LED TV for people switching from CRT TV to LED TV .\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6903"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"13","downvotes":"4","content":"I was scared to purchase VU brand because I was not aware about that but now feel I had taken right decision to buy VU.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Picture quality is awesome,  HD picture quality is also awesome compare to branded.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  As of now I'm satisfy from this product.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Little bit having sound issue but I have connected with sound bar.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Hopefully after few years I will be on my review\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6904"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific purchase","upvotes":"11","downvotes":"3","content":"I liked the tv very much. I received the tv in 3 days after booking and the tv got installed that day only. Full marks to flipkart and jeeves. The picture quality of tv is great but in sd channels it looks little strecthed so you have to subscribe to hd channels for best experience. Sound is loud and superb. In all i can say that it was a good purchase at a price of 20000.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6905"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Five Stars","upvotes":"39","downvotes":"21","content":"I have researched all current models and decided it. Friends this tv is much better than Sony and Samsung 4K tvs. The panel  Vu used is extremely bright and colourful. Finally got what I wanted. Also thanks Flipkart for early delivery.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6906"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Absolute rubbish!","upvotes":"9","downvotes":"2","content":"purchase the product in view of diwali. still not installed after so many days. FLIPKART spoiled my festival.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6907"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Decent product","upvotes":"21","downvotes":"9","content":"Amazing service from Flipkart. Delivery and installation done in 24 hrs. Picture quality is crisp and colours look bright. Value for money product\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6908"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worth every penny","upvotes":"4","downvotes":"0","content":"Superb no words to describe this beauty.... Use speakers for better experience\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d6909"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Highly recommended","upvotes":"12","downvotes":"4","content":"I have booked TV on 11th Oct 17 and delivered on 13th Oct. I bought it for 14,500/- with exchange of my old TV (4000/-) and Bank offer.   Packing was extremely good.. and installed on 14th oct 17. I'm satisfied with delivery and installation.. 4/5. (Fitting is perfect and Demo is not done, might be he may felt like everyone knows basic TV settings and options).\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Now lets talk about TV..\n  \u003cbr/\u003e\n  Build quality- 4/5 plasticyyyy product.. which is not give u odd look..\n  \u003cbr/\u003e\n  Picture quality- 5/5 best in this price..\n  \u003cbr/\u003e\n  Sound quality- 3/5 VU need to improve here.. Bcoz sound is loud enough for 15x15 room.. but not clear.. (any way I am using my Philips sound bar, which is giving feeling like home theater )\n  \u003cbr/\u003e\n  Connectivity- 3/5 DTH is working fine.. HDMI cables plug are not in right place. But we can manage, as it is one time activity.\n  \u003cbr/\u003e\n  Pros..\n  \u003cbr/\u003e\n  Everything is just Wow.. (with respective to the cost)\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Cons..\n  \u003cbr/\u003e\n  Sound is not good..\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Go for it guys.. best deal. Thank you Flipkart.\n  \u003cbr/\u003e\n  If u find this review helpful..than give a thumbs up.. Thank you.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d690a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Slightly disappointed","upvotes":"9","downvotes":"3","content":"Sound clarity is not good even after adjusting in user's profile.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5be8150d0a7e2d690b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"21","downvotes":"12","content":"Excellent TV, delivery and installation was prompt, This is one of the best LED TV u can buy for this price range\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5de8150d0a7e2d690c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Decent purchase","upvotes":"7","downvotes":"2","content":"Loved watching it on HD,  picture quality very good,  some improvement could be done towards sound quality,  not bad though.  Within this price range,  it's unbeatable.  Overall a luxury TV, Must go for it...!!!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5de8150d0a7e2d690d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"delivery","upvotes":"3","downvotes":"0","content":"pitcher quality is good     but geti courier delivery very bad...    \n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5de8150d0a7e2d690e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Horrible","upvotes":"3","downvotes":"0","content":"TV does switches off immediately after switched on by the service engineer during installation. I wanted money back but Flipkart only replaces the TV. Waiting for replacement and don't know how the new unit will work. Cheap China made item.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5ee8150d0a7e2d690f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"fantastic vu","upvotes":"3","downvotes":"0","content":"i am lazy to type all things in detail. i can just say...it is fantastic!  but disappointed from flipkart as i felt offer price during big billion it is 19,999.. but even now it is showing same price\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5ee8150d0a7e2d6910"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Great product","upvotes":"20","downvotes":"13","content":"At 22k it's a very good deal. Only Audio is an issue , it is not that loud. But yeah I am satisfied with it. Otherwise all other feaures etc are good. Played different different format of HD videos, performance is decent.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5ee8150d0a7e2d6911"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Classy product","upvotes":"5","downvotes":"1","content":"Picture quality is good\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5ee8150d0a7e2d6912"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Don't waste your money","upvotes":"8","downvotes":"3","content":"Picture quality is less comparing to the video showen in Flipkart\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5ee8150d0a7e2d6913"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Perfect product!","upvotes":"9","downvotes":"4","content":"Pros:\n  \u003cbr/\u003e\n  - Excellent picture quality, comparable to top brands like Samsung and Sony.\n  \u003cbr/\u003e\n  - remote and consecutive actions are responsive and fast\n  \u003cbr/\u003e\n  - playing files from usb is pleasant experience (subtitles get detected automatically)\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Cons:\n  \u003cbr/\u003e\n  - average speakers, you should invest in good quality speaker, don't rely on 3.5mm port on tv, go for av/HDMI to 3.5 mm converter with splitter\n  \u003cbr/\u003e\n  - it's not slim at all... In smaller rooms it may look weird hooked up on wall\n  \u003cbr/\u003e\n  - my pendrive attached to USB port gets really hot... So careful not to leave it there\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Giving 5 stars Couldn't get better deal at this price.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5ee8150d0a7e2d6914"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Quality doesn't look good","upvotes":"10","downvotes":"5","content":"Its looking HD ready TV, not full HD , disappointed with the quality\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b5ee8150d0a7e2d6915"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Excellent picture quality,  Good sound, Poor USB player","upvotes":"6","downvotes":"2","content":"Overall it's an excellent product in this price range. But USB media player has some issue regarding the aspect ratio. So for those who like to watch movies using USB, please note the below issue before buying the same.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  There is no option to keep the source aspect ratio while using USB media player. It works fine with videos which are in 16:9 aspect ratio. In most scenarios we can see that source file of movies now a days are in 21:9 (or not in 16:9 exactly) and in these cases the videos looks vertically stretched in order to fit its 16:9 aspect ratio, creating distorted images. There is no option in menu to keep the Source Aspect Ratio, while using USB media player.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  In order to update/fix the USB media player bug, I have logged a complaint with VU customer support with Call No. VU145701 dated 08 Nov 2017, but no updates as of now.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d6916"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"For VU 39inch model Full Hd","upvotes":"20","downvotes":"16","content":"It is my first led tv from online which is truly fulfilled my requirements.Installment is very good.they give all information regarding to tv and it's operating.TV is good for Full HD with good sound for medium size hall\n  \u003cbr/\u003e\n  Thank you for my parents happiness also.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d6917"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Hated it!","upvotes":"84","downvotes":"99","content":"Guys dont buy vu tv. I have bought this tv one month back. After getting it delivered vu company technician came and mounted it. From the same day small patch started appearing when we on the tv. And in next few days only it covered almost half screen.\n  \u003cbr/\u003e\n  Neither vu nor flipkart is ready to replace the tv.\n  \u003cbr/\u003e\n  I spent more than 20k for this tv.\n  \u003cbr/\u003e\n  They are demanding 16k to replace the tv.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Plz plz plz dont ever think to buy vu tv.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d6918"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Value-for-money","upvotes":"9","downvotes":"5","content":"First thanks to flipkart I ordered 20sep 2017 midnight and I got 20th September @6.10pm fast deliver and I got Instalation at 9pm pakka mass  coming to Vu tv 18999/- superb special price best picture quality 1080p full HD quality good panel with nice design almost all video formats playing in USB DRIVE small default was sound too low but overall a awesome  budget TV\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d6919"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Four Stars","upvotes":"24","downvotes":"22","content":"It's good, HD channels are great, I purchased 2017 edition, 39 inch.i read reviews which stated sound is not good. I don't know if they fixed this issue in 2017 edition. The sound is low when playing content over USB. But,it is pretty good over HDMI.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d691a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Just wow!","upvotes":"4","downvotes":"1","content":"Very Good worth of money,  Nice quality all format supporting nice. Installation done by company on time.. Delivery on time overall great experience Thank you Flipkart..\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d691b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Perfect product!","upvotes":"4","downvotes":"1","content":"Very good product, a complete package at the best possible price.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Installation process was also very smooth.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Without any doubt go for it.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d691c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific purchase","upvotes":"3","downvotes":"1","content":"For this price the TV is solid value for money. There are only 2 hdmi ports which are placed at the back and pretty much obscured. Otherwise panel is good for this price but is a bit warm.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Pros: Bright panel and good viewing angles, decent black levels, speakers are good.\n  \u003cbr/\u003e\n  Cons:Not enough ports, Warmer tone.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d691d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worth the money","upvotes":"4","downvotes":"1","content":"Ok satisfied\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d691e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"The \"Vu\" is perfect !!","upvotes":"4","downvotes":"1","content":"If you don't read the brand logo you won't know if it's not Sony or panasonic. The picture quality is great. The build quality is optimal. There are appropriate connectivity ports. User interface is decent. It's a bang for your buck..\n  \u003cbr/\u003e\n  Long term user experience awaits. Have purchased extended warranty from Flipkart as well. Just in case ;)\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b60e8150d0a7e2d691f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Absolute rubbish!","upvotes":"19","downvotes":"18","content":"Picture quality is too bad. Worse than LCD.  Very poor refresh rate. You can see the glitchs when watching any even normal fast moving sports or song. You will see multiple ghost of the ball in case you are watching hockey or cricket. Picture quality in HD Channels is some what ok but in case of normal channels it is pathetic. You will see a very blurred image and watching any fast moving song or sports is a nightmare in normal channels. In HD picture is a little clear but poor refresh rate is very much visible in normal viewing. Had requested for return but Flipkart dont have any return policy. On complaining their technician visited and informed that this is only for HD viewing. Normal broadcasting channels are not supported by this TV. They informed that one will get only this much at this price.  Their claim of refresh rate and A grade is complete falsh. Regretting buying this TV. I suggest go for a better brand and that too after seeing the actual product rather than trusting any one without seeing the product. Regretting the decision to buy this TV.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6920"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Useless product","upvotes":"5","downvotes":"2","content":"TV clearity illa Bluray print play agala romba worst aa iruku waste kasu Dan waste VU\n  \u003cbr/\u003e\n  KASU PONADHUDAN MICHAM\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6921"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worth every penny","upvotes":"2","downvotes":"0","content":"Very good product, picture quality is best and even sound is good... I recommend to buy... flipkart service is very good...\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6922"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Fabulous!","upvotes":"2","downvotes":"0","content":"Awesome Tv yaaar in reasonable price happy with the product\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6923"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Excellent","upvotes":"2","downvotes":"0","content":"Good product, delivered on time\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6924"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific purchase","upvotes":"2","downvotes":"0","content":"After one month use....Overall good tv\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6925"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Wonderful","upvotes":"2","downvotes":"0","content":"Good product\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6926"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"2","downvotes":"0","content":"Super\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6927"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Awesome","upvotes":"2","downvotes":"0","content":"very good picture quality excellent tv\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6928"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good choice","upvotes":"2","downvotes":"0","content":"Best quality\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b63e8150d0a7e2d6929"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Fabulous!","upvotes":"2","downvotes":"0","content":"Great product value for money.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d692a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Decent product","upvotes":"2","downvotes":"0","content":"Tv is very good no doubt about that.\n  \u003cbr/\u003e\n  Nice picture quality\n  \u003cbr/\u003e\n  Sound is also good considering price range\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  3 stars becaise that no cost emi is a trap, do not fall into it. I have opted no cost emi option but paying intrrst to the bank.\n  \u003cbr/\u003e\n  Bank says talk to flipkart n flipkart says talk to bank so u will end up paying intrest.\n  \u003cbr/\u003e\n  I am doing shopping with flipkart from last 4 years and i can say that flipkart has bcm very cheap seller with no customer service as all from last one year. I wish this is my last purchase\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d692b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific","upvotes":"2","downvotes":"0","content":"I had seen the vu LCD (Not LED) tv about five years before during the visit of Mumbai Chor bazaar. It was 32 inches LCD tv displayed in a shop of second hand tv dealer.I was just passer by of the street, suddenly I stop there and watch the video of a reality show displayed on vu tv. I really mesmerized by the quality of video .It was the first instance when I knew the fact that a good company exists in this world named as vu. Recently I had bought a 39 inches vu Full HD tv in sale around 16.5k from flipkart. I am using this tv for last 15 days and 100 % satisfied with the tv. The colour balance is amazingly sharp with minute details.It is my recommendation to all those people who are planning to purchase a led tv in tight budget must go with vu tv.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d692c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good choice","upvotes":"2","downvotes":"0","content":"Tv looks good,\n  \u003cbr/\u003e\n  Sound on the TV is normal one can use for home connection ,more than loud sound.\n  \u003cbr/\u003e\n  Display is good IAM able to connect my PC were I get best resolution.\n  \u003cbr/\u003e\n  Cable TV resolutions are not great,most of the movie format it's playing 8vout of 10 format.\n  \u003cbr/\u003e\n  Over all good for the price hope it works well for couple of years.\n  \u003cbr/\u003e\n  Tc is not having any screen heating problem.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d692d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Perfect product!","upvotes":"2","downvotes":"0","content":"Good quality\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d692e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worth every penny","upvotes":"2","downvotes":"0","content":"Very nice tv\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d692f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Perfect product!","upvotes":"2","downvotes":"0","content":" THE GOOD BUDGET TV\n  \u003cbr/\u003e\n   THE QUALITY WAS SAME  LG,SONY\n  \u003cbr/\u003e\n   FLIPKART SERVICE 5 \n  \u003cbr/\u003e\n   AWESOME SOUND BUT LITTLE HUMMING WITH HOME THEATER SYSTEM\n  \u003cbr/\u003e\n   MOVIES EXPERIENCE WAS SUPERB\n  \u003cbr/\u003e\n   OVERALL BEST PRODUCT\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d6930"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Very good, but lacks basic audio features.","upvotes":"2","downvotes":"0","content":"I am fully satisfied.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Pros:\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  The display clarity is as good as many other popular brands' TVs.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Cons:\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  The EQ has only bass and treble. They could have provided other Hz as well.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  In some branded TVs, when you connect an external speaker through the 3.5 audio out, you will have the option to choose whether the TV speaker should still sound or should be muted. Because, you don't want to watch TV serial in 5.1 surround speaker, but you will wish to watch your favorite Hollywood movie in it. You cant just keep plug and unplug the audio out every time. (1) It is not easy to reach the plug, (2) It will damage the port. Using this feature, you can just keep the external speaker plugged in all the time, and while watching serial, you can turn on TV speaker and for movies turn on the surround speaker and turn off the TV speaker. Since the slim LED TVs cant accommodate huge speakers, pretty much every TV has very average sound (And no bass whatsoever) and for this reason people tend to go for external speaker. Therefore this feature is a basic need.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  I am saddened to see this TV does not have this feature, even many other popular brand TVs don't. I wish VU reads this and provides this basic feature in all the TVs.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d6931"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Simply awesome","upvotes":"2","downvotes":"0","content":"Used it for a week. Must say a quality product for this price.\n  \u003cbr/\u003e\n  HD movies looks perfect and with a quality comparable to my primary Samsung series 4 panel.\n  \u003cbr/\u003e\n  I'm using this as my desktop monitor and works just fine,actually fluent than my original desktop monitor cause of good refreh rates and games looks splendid note that I'm using a AMD Graphic card in my CPU.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  I have tried usb option and plays all fromat.atleast all which I tried.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Sound is low but I never used stock speaker, using FND speakers connected to my cpu.\n  \u003cbr/\u003e\n  All in one a perfect buy for 19k.\n  \u003cbr/\u003e\n  Should last longer and my next 4k tv can be VU, who knows.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d6932"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Four Stars","upvotes":"1","downvotes":"0","content":"Resolution is good..everything is ok except sound...sound is very low while playing via USB or HDMI. Please rectify in future versions!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b66e8150d0a7e2d6933"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Very Good","upvotes":"14","downvotes":"15","content":"Delivery-Excellent\n  \u003cbr/\u003e\n  Product- Very Good\n  \u003cbr/\u003e\n  Installation-Very Good\n  \u003cbr/\u003e\n  Audio- Average( Not very high but good enough for a normal living room surrounds. You can get good sounds with extra speakers)\n  \u003cbr/\u003e\n  Picture Quality- Very Good\n  \u003cbr/\u003e\n  Price - Excellent  ( With respect to the product quality the  price offered is a big big deal)\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d6934"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worthless","upvotes":"3","downvotes":"1","content":"Worst installation and the installation guy is theft my TV wallmount stand. Bad installation service. But tv quality good but bad installation worst guy installation guy.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d6935"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Simply awesome","upvotes":"3","downvotes":"1","content":"It's amazing product.. No words to say.. just like anything which will cost you 40k +..\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  The delivery was late by a day but it's ok as the product was delivered safe.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Jeeves people are just bad as the technition had stolen my TV wall mount as I was using the table mount. My brother was only there at the time of installation and he didn't noticed that the wall mount was missing. But he noticed that he was something in his pocket which was bulging outside.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  The next day  when I reached home I was amazed by the way the tv looked but after checking the box i find out the wall mount was missing. I called the technition and told him that I haven't seen the wall mount and if it was there during the unboxing. I told him that much polite that he can't say that it wasn't there, but he said that in some cases, the wall mount have been reported missing. So I told him that I should email a complaint to flipkart. I cut the call.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  He called me back immediately and said that there is nothing to be complained as VU has given them 30 wall mounts as sometimes it's found missing. I know it  was a big lie at the instant he told but I don't tell him anything.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Two days after he give me the wall mount and on the box it's printed that it's for VU 40D321. What a fool he is. He stoled my wall mount and said a big lie and returned my own product.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  After all I get it back.  It was not a good incident that too from flipkarts authorized service network.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  ITS TIME TO RETHINK ABOUT JEEVES FLIPKART.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d6936"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Wonderful","upvotes":"3","downvotes":"1","content":"This is an awesome product.. Too good for the price.\n  \u003cbr/\u003e\n  One big issue with this product is placement of HDMI ports.. Ports are placed very close to each other at the rear of the panel and also lower frame is very close to Port point. They are difficult to reach and almost can't be used both at a time because of spacing.\n  \u003cbr/\u003e\n  My usage is, one HDMI cable and a chrome cast device. Chrome cast device power cable has to be bent so badly, it may break some day.\n  \u003cbr/\u003e\n  Port placement is very badly designed, no common sense is used by the design engineers.\n  \u003cbr/\u003e\n  Vu should atleast provide a HDMI port extension cable to cover up there bad design part.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d6937"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Quality is good","upvotes":"3","downvotes":"1","content":"Service is very good ,  at the time of delivery and installation ,  also I m going to purchase more 3 VU TV for our relative's, low volume as compared other brand but for home sufficient volume and picture quality is good no problem\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d6938"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Brilliant","upvotes":"3","downvotes":"1","content":"Best TV in affordable price ... Just one day delivery and installation  . Thanks Flipkart. I'vec purchased 5 VU TVs so far from last 2 years ... I haven't got any single issue out of 5Tvs . The best in class. Thanks VU n Flipkart . c\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d6939"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Five Stars","upvotes":"3","downvotes":"1","content":"Good picture quality..highly recommended... Delivery is very fast got product in within 2 days.. now waiting for the technician to wall mount...best tv\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d693a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worth the money","upvotes":"3","downvotes":"1","content":"Nice product, value for money. Power adapter should be external, so if there is any fault, it can be replaced easily. Little difference in brightness in pixels at some places.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d693b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Excellent","upvotes":"4","downvotes":"2","content":"I bought this 39in vu led tv in BB Days Rs 18500 and 2 years extended warranty 1325, I think it's a great deal. Brilliant picture quality, it's awesome, connecting ports were good with no delay.\n  \u003cbr/\u003e\n  Sound also good not bad on SD, if it's HD or full HD then audio excellent. The installation were great from jeeves based on my request. Everything good from flipkart and jeeves side,  This is my second vu 40 in led tv bought from flipkart. If any body planning to buy 40 in led tv within the budget simply go for it.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d693c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"VU 39\"  ","upvotes":"21","downvotes":"29","content":"Nice Tv, I am using it from last 1 week, it is 2017 new edition launched by VU .\n  \u003cbr/\u003e\n  Picture and sound quality is  nice, today I watch 1080 pixel video shooted  from my moto G4 plus,.\n  \u003cbr/\u003e\n  Price range is also good.one single panel button long press used for  on/off TV and low press for choosing input modes like USB,HDMI,AV in etc.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b69e8150d0a7e2d693d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Hated it!","upvotes":"19","downvotes":"26","content":"I recommend all people's if you believe Flipkart then just you are blind bcz before 1 year my situation is also like you. i belived flipkart blindly but after continue 3rd time  they provided me bad service support and now i am writing this to just open your eyes and don't buy from them After 1 month of struggle still i didn't find any resolution of my complaint. Better to purchase from local shop bcz there you can check your product and if something found which is not good you can take help of that local shopkeeper. But they are the online giant and they do not care of there values or customer who is frustrating since last month. Pls pls once visit your local store before buying from Flipkart.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d693e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Best TV in his range..Worth buying..","upvotes":"20","downvotes":"29","content":"Pros:\n  \u003cbr/\u003e\n  # Good picture quality\n  \u003cbr/\u003e\n  # Good sound quality on high volume\n  \u003cbr/\u003e\n  # Very thin border/bezel 8mm top/left/right and 1.5cm bottom border\n  \u003cbr/\u003e\n  # Stylish looks and nice blue/red standby LED\n  \u003cbr/\u003e\n  # Lots of inputs/outputs options 2HDMI, VGA, 2USB and many others.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Cons:\n  \u003cbr/\u003e\n  - Poor sound quality on low volume\n  \u003cbr/\u003e\n  - Difficult to accessing HDMI/VGA ports after wall mount\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d693f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Brilliant","upvotes":"4","downvotes":"3","content":"Got this awesome tv for Rs.17500 in BBD sale,\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Picture Quality 10/10\n  \u003cbr/\u003e\n  Audio Quality 8/10 I dont know why people are complaing about the audio quality.\n  \u003cbr/\u003e\n  Conectivity 10/10 2 HDMI,2XUSB,3.5MM Jack.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Picture quality is awesome with HD set top box\n  \u003cbr/\u003e\n  You can play 1080P video files using USB in almost any format including MKV dual audio, you can change audio track as well.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Overall its a great TV\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6940"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Delightful","upvotes":"5","downvotes":"5","content":"Wow vu 98cm 39inch full hd tv i like  very much pictures  quality,  iam gamer    super  1080p gaming ,  but sound quality   not good. Other features  all super, tv price19999rs and flipkart.  Chrome cast working  super .\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6941"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Excellent at this price. Just go for it !!!","upvotes":"3","downvotes":"2","content":"It was a good transition for me from 32\" Samsung LED to 39\" Vu. To be honest, the first thing that attracted me was the price tag, and topped with the SBI debit card offer this was an offer hard to miss. It was really a deal at Rs 18500. To be safe, I had also purchased a 2 year warranty from Jeeves, just in case :) . Also the reviews from Vu customers prompted to go for it.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  The following are my observations after 2 days of use:\n  \u003cbr/\u003e\n  PROS:\n  \u003cbr/\u003e\n  a. Delivery super fast, and the installation by Jeeves was very professional.\n  \u003cbr/\u003e\n  b. Very thin bezel, giving it a sleek and premium look.\n  \u003cbr/\u003e\n  c. Colour rendition is top class.\n  \u003cbr/\u003e\n  d. Plays all video formats. (Played Avatar bluray rip, and the experience was awesome)\n  \u003cbr/\u003e\n  e. Interface very friendly.\n  \u003cbr/\u003e\n  f. Build quality is very good - Comparably to Samsung or Sony.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  CONS:\n  \u003cbr/\u003e\n  a. The HDMI ports seem difficult to access, I have to move the TV to change HDMI cable.\n  \u003cbr/\u003e\n  b. Sound is a major disappointment. The max volume is just OK for a medium sized room. Will not be sufficient for a bigger hall. This can be addressed with a speaker system though.\n  \u003cbr/\u003e\n  c. Sound clarity could have been improved.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  However going by the price tag, the cons can be overlooked.  The same size LED from Samsung or Sony would have been priced atleast 35 K or more. So I feel this was a good decision. I hope Vu does not let me down in future ;)\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6942"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"best value for money ..... :D","upvotes":"3","downvotes":"2","content":"i bought this tv some days ago and it worked only for 3hours but i used flipkarts return policy and got the replacement done in just 3 days and new one working fine ... i think that was a manufacturing defect that can happen with any electronics device so its ok   ... it s the best tv in this price range and offers gr8 picture and sound quality .. but audio output is a bit low  if u watch movie through pen drive but its not that bad so overall vry good product .....\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6943"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Fabulous!","upvotes":"3","downvotes":"2","content":"Picture quality is awesome..! Stylish and very slim look..! Value for money..You no need to spend much money to purchase Sony, Samsung or LG brand. Just go for it..You will fall in love for \"VU\"\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6944"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Don't waste your money","upvotes":"2","downvotes":"1","content":"Not upto the level\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6945"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Pretty good","upvotes":"2","downvotes":"1","content":"Value for money.use HDMI cable for better reception.Best tv in a low prise but sound is not so good.Penal should be attractive.You can buy if you don't want to spend a large amt and enjoy a big screen.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6946"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Must buy!","upvotes":"2","downvotes":"1","content":"Great Product!\n  \u003cbr/\u003e\n  I have exchanged my old VU LCD 40 Inch TV with this brand new VU LED.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Past experience -\n  \u003cbr/\u003e\n  Viewing Experience - Always great, clarity I can always compare with Sony, really happy with the screen resolution and clarity.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Service Experience - Worst ever, not sure if that have changed in last 2 years but it was pathetic and painful, just two unprofessional females were there in call centre, long hold, lack of knowledge, they put you on hold for 15 mins and keep on gossiping with each other,parts were not available easily it took 3-4 months to get my VU LCD repaired(happened twice).\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Just exchange because of the viewing experience and offers available and ignored service experience completely hoping they must have improved post Flipkart association.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b6ce8150d0a7e2d6947"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Awesome under budget product","upvotes":"2","downvotes":"1","content":"Video quality 9/10\n  \u003cbr/\u003e\n  Audio. 8/10\n  \u003cbr/\u003e\n  Side angle view is perfect.\n  \u003cbr/\u003e\n  Video quality is awesome and sound quality is perfect.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d6948"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Three Stars","upvotes":"2","downvotes":"1","content":"Sound quality is worst\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d6949"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good","upvotes":"2","downvotes":"1","content":"Best budget TV.\n  \u003cbr/\u003e\n  Super picture clarity. Flipkart service was good. The seller delivered the TV before one day of the delivery time.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  No switches in TV, only use with remote.\n  \u003cbr/\u003e\n  Can't connect 5.1 Home Theater(no ports).\n  \u003cbr/\u003e\n  Tv speakers sound poor quality.\n  \u003cbr/\u003e\n  All video size/files shows in full screen, can't reduce.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d694a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Value-for-money","upvotes":"2","downvotes":"1","content":"Nice picture quality even in SD video are so clear\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d694b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good choice","upvotes":"1","downvotes":"0","content":"Thanks to flipkart for great delivery and installation of product.\n  \u003cbr/\u003e\n  Here's my review about this product after use of 1 month..\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Picture Quality 4/5\n  \u003cbr/\u003e\n  Sound -  3/5\n  \u003cbr/\u003e\n  Looks 5/5\n  \u003cbr/\u003e\n  Still at this range this one is too good. Must buy if u want to exprience something good in low budget.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d694c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Excellent","upvotes":"1","downvotes":"0","content":"Excellent product.. Go for it\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d694d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Wonderful","upvotes":"1","downvotes":"0","content":"A very good product from VU.  I received a TV (39 FHD) through Flipkart today at Kolkata. Thanks Flipkart for maintaing its price, date and time schedule. Delivery persons and Mr Rahul of Jeeves are also very good and efficient in their profession.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d694e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Utterly Disappointed","upvotes":"0","downvotes":"0","content":"After sales service is poor, the company gives unnecessary excuses to back up from warranty. In my case i have a three year warranty but the TV screen gave up in just 4 months, and now the service team is playing with me and giving excuses just to escape from the warranty policy. Request you all to be aware.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d694f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Very poor","upvotes":"0","downvotes":"0","content":"i purchased the Vu tv suppy the tv , but not properly fitting the item, so tv fell down and damaged completly.even we complaint regarding no bady care, simply give the answer the is not my mistake, poor services. dont purchase this product in visakhapatnam\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d6950"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Mind-blowing purchase","upvotes":"1","downvotes":"0","content":"Heard a lot..... Researched a lot....took a gambling....and got this masterpiece.... Sometimes it makes me rethink...did i really bought it under 20 k....\n  \u003cbr/\u003e\n  Its amazing... Simply amazing from all aspect...\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b71e8150d0a7e2d6951"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Excellent TV","upvotes":"1","downvotes":"0","content":"Very nice TV in this price. Got it at 19000.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Picture quality is good.\n  \u003cbr/\u003e\n  Audio is good.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6952"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Must buy!","upvotes":"1","downvotes":"0","content":"The colour of led is superb and sound quality is good.And led look very premium quality\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6953"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrible product","upvotes":"1","downvotes":"0","content":"Ok\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6954"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Very Good","upvotes":"1","downvotes":"0","content":"picture quality asm.\n  \u003cbr/\u003e\n  like smartphone\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6955"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good quality product","upvotes":"1","downvotes":"0","content":"Superb tv...\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6956"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Fabulous!","upvotes":"1","downvotes":"0","content":"Thank you flipkart team for ontime delivery and product is also very good. Highly recommended site and vu as well\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6957"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Must buy!","upvotes":"1","downvotes":"0","content":"Best product in this price good picture quality\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6958"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Awesome","upvotes":"1","downvotes":"0","content":"Very nice I'm happy\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d6959"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Just wow!","upvotes":"1","downvotes":"0","content":"Excellent product, very good picture quality. I recommend this product.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d695a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Great product","upvotes":"1","downvotes":"0","content":"Excellent service by Flipkart.Installation with in 2hrs after received TV.Vu 39 inch TV look display reception excellent.Sound good.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b74e8150d0a7e2d695b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good quality product","upvotes":"1","downvotes":"0","content":"Very good tv user friendly\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d695c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Just wow!","upvotes":"1","downvotes":"0","content":"Delivery and installation was pretty good on time execution...\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  After a week review Tv working good HD picture quality fabelious  worth for money\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d695d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good quality product","upvotes":"1","downvotes":"0","content":"Very good item\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d695e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific purchase","upvotes":"1","downvotes":"0","content":"Good\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d695f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Pretty good","upvotes":"1","downvotes":"0","content":"Pictures quality is quite good \u0026amp; sound also\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d6960"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Slightly disappointed","upvotes":"0","downvotes":"0","content":"Flipkart's worst service till date.Please don't buy this TV just because they delivered the TV but till date no one has shown up at my door to demo and install.Third class service\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d6961"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Very poor","upvotes":"1","downvotes":"0","content":"Broken Led Received\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d6962"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Wonderful","upvotes":"1","downvotes":"0","content":"As per my concern flip cart is very good vu technician who installed TV does not explain all options. In this TV we are poorly watching SD channels and sound is not to the mark.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d6963"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Just wow!","upvotes":"1","downvotes":"0","content":"Vu 39 fhd tv is awesome... Better picture clarity and decent sound... Compare.. Samsung, sony.. This company is best...\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  But i have facing one problem... The tv Have earth shock problem... Can anyone help me...\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d6964"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"0","downvotes":"0","content":"Tv quality is nice at this price. Even sound output is good not excellent as other expecting but completely worth for this price. Don't put questions in mind by watching one star review So its a good deal to buy this tv... Good product\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b76e8150d0a7e2d6965"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good choice","upvotes":"0","downvotes":"0","content":"Video quality is good. .mkv format is working including x265 codec (but some files unsupported) . Audio is NOT crystal clear. Too much noise. Little Hard to understand the dialogues while watching movies.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d6966"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Best in the market!","upvotes":"1","downvotes":"0","content":"Lovely product by flipkart....I like very much...\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d6967"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"What exactly what i needed","upvotes":"1","downvotes":"0","content":"Amazing product and a super deal. Worth every cent. Word of advise , no need to go for smart tv or cable, buy a chrome cast for inr 3,999 and all set.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d6968"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Hated it!","upvotes":"1","downvotes":"0","content":"Good tv\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d6969"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Expected a better product","upvotes":"1","downvotes":"0","content":"The delivered product was completely damaged. LED screen was broken and has to request for the replacement. This was a surprise for my parents but dint workout.. delivery was in time . Thanks\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d696a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific","upvotes":"1","downvotes":"0","content":"I bought around 8 TV still now in past 2 years for my family's and relatives.its is awesome .Good looking and picture clarity and no issue's still in none of the TV which I bought.people can go blindly for VU product.worth for money compare to other products.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d696b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good","upvotes":"1","downvotes":"0","content":"Very good product with temporary available mechanic. I was having old LCD and I ordered new this VU tv which is supperb. But I face issue like the person came 1 days before the appointment scheduled and he was rude and not ready to remove existing TV from wall after offering his fees also. I need to hire new mechnic amd he removed my existing TV them on next day new person came from Flipkart and fitted TV. By reviewing TV its a fentastic TV  in this range. This 3 Star only because of service. Tv 5STAR\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d696c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Fabulous!","upvotes":"1","downvotes":"0","content":"Very good brand and installation was done by professional experts. No charge for installation. TV visual quality was very good and excellent. Delivered with in 3 days\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d696d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Pretty good","upvotes":"1","downvotes":"0","content":"Super picture quality and sound...... Best product in budget....\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d696e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Very Good","upvotes":"1","downvotes":"0","content":"Bought this TV before 2 Months and it is showing awesome time...no problem faced till now...sound is not as expected\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b79e8150d0a7e2d696f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worth every penny","upvotes":"1","downvotes":"0","content":"Nice and awesome product..i am using Tatasky doesn't require any hd pack.go and buy it.simply nice\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6970"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Classy product","upvotes":"1","downvotes":"0","content":"Led dsign is very good and pictures quality and colour is very good and most important of  sound is very clear and loud. I love it this VU  led is good.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6971"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Classy product","upvotes":"1","downvotes":"0","content":"Great sound and great quality..!!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6972"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific","upvotes":"1","downvotes":"0","content":"Bro don't think more. It's much better than sony, samsung, Panasonic and others. Just go for it.\n  \u003cbr/\u003e\n  Quality 100%\n  \u003cbr/\u003e\n  Price.    100%\n  \u003cbr/\u003e\n  Full value for money.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6973"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"0","downvotes":"0","content":"Fantabulous this is, I have coupled this with an Airtel HD Connection and the experience is just wow !!!\n  \u003cbr/\u003e\n  Do not expect anything extraordinary with a normal connection. Go necessarily with a HD connection for the best experience.\n  \u003cbr/\u003e\n  Delivery and installation top notch, completed within 48 hours. Great television from VU, keep doing good work !!!\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6974"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"0","downvotes":"0","content":"Nice\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6975"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Nice product","upvotes":"0","downvotes":"0","content":"Nice product\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6976"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good quality product","upvotes":"0","downvotes":"0","content":"Tv is awesome for under 20k segment.Installation is also very good. Happy with faster delivery of flipcart for first time.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6977"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Good quality product","upvotes":"1","downvotes":"0","content":"Superb.... Value for money...\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6978"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Worth the money","upvotes":"1","downvotes":"0","content":"Product is good as expect , will monitor for few more days and comment on this\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7ce8150d0a7e2d6979"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Horrible","upvotes":"0","downvotes":"0","content":"Not satisfied with sound and picture\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d697a"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Decent product","upvotes":"0","downvotes":"0","content":"Decent buy at this range with FHD 39\" HDMI ports should have been 3-4. 2 ports now a days is a pain. Overall must buy for this price......\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d697b"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Terrific","upvotes":"1","downvotes":"0","content":"Excellent tv. Superb pictures quality. Average sound. Looks good. In this price point (19999)awesome. Thanks flipkart\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d697c"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Very poor","upvotes":"1","downvotes":"0","content":"Delivery was too late and i travelled 50 km to collect the tv. Not happy with the service.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d697d"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Not good","upvotes":"1","downvotes":"0","content":"Not upto th mark compared to branded TV's.. giving better picture only in full hd or Blu-ray movies... Cable sd channels sucks..\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d697e"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"1","downvotes":"0","content":"Fantabulous tv in the cost of a mobile . It's amazing clarity and sound experience is terrific. I bought it in the offer price of 16400. Installation was done within 2 days. No negative comments i can give for this price. Worth for money ever....\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d697f"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Awesome","upvotes":"1","downvotes":"0","content":"After using a week, now I can say that this is the best LED tv in this price range. The picture quality is amazing and it support full HD videos.although the sound quality is not up to the mark but still it has decent enough for ur hall or small room.After using it I can say just go for it if you have small budget. You won't regret buying it.the led is brilliant.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d6980"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Not recommended at all","upvotes":"0","downvotes":"0","content":"Very very worst service from fk and jeeves\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d6981"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Best FHD led TV in INDIA below 20k range !!!!!","upvotes":"1","downvotes":"0","content":"Review after 5 days....\n  \u003cbr/\u003e\n  I bought Vu 39\" FHD led Tv from Flipkart at 18999 in offer.but i missed 10% extra instant discount because of SBI credit card jo mere pas nahi tha.\n  \u003cbr/\u003e\n  Anyways i am still happy and satisfied.\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  - Best part is Picture Quality which is awesome when you watch HD channels from any set top box. and please maintain distance atleast 3 mtr to watch Tv otherwise u will not get that quality which u really want.\n  \u003cbr/\u003e\n  (I have Tata Sky HD box, and also suggest u to prefer tatsky HD)\n  \u003cbr/\u003e\n  - 2 HDMI \u0026amp; 2 Usb port\n  \u003cbr/\u003e\n  - 3.5mm jack for headphone or speaker\n  \u003cbr/\u003e\n  - true viewing angle\n  \u003cbr/\u003e\n  - Noise cancellation function.\n  \u003cbr/\u003e\n  - After 6 hrs continue watching, panel doesn't  get heated. thats y i says its worth it.\n  \u003cbr/\u003e\n  - Sound is loud but not clear type.(but u can avoid it because almost people using home theatre nowadays)\n  \u003cbr/\u003e\n  \u003cbr/\u003e\n  Finally i say you that dont be late and purchase it if u want any FHD led tv below 20 k.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d6982"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Value-for-money","upvotes":"1","downvotes":"0","content":"I brought this product before 50 days, it`s very good, and quality for this prise, picture quality,sound,head phone,vga port, Hdmi port all are fine,\n  \u003cbr/\u003e\n  Cons: one thing lagging is Audio output, you can take from headphone, you cant change sound tv and home theatre through Remote, or go for Digital output, my old Home theatre not having Digital Audio in, its my challenges, but overall very good.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
{"_id":{"$oid":"5a757b7fe8150d0a7e2d6983"},"name":"Vu 98cm (39 inch) Full HD LED TV","link":"https://www.flipkart.com/vu-98cm-39-inch-full-hd-led-tv/product-reviews/itmeuynquyqaw4kz?pid=TVSEUYNQHHUEXQH8","review title":"Super!","upvotes":"1","downvotes":"0","content":"Excellent TV for the price. No complaints. Display, sound, clarity too good.\n \u003c/div\u003e\n \u003cspan class=\"_2jRR3v\"\u003e\n  \u003cspan\u003e\n   READ MORE\n  \u003c/span\u003e\n \u003c/span\u003e"}
